In [23]:
import numpy as np
import pandas as pd

In [19]:
aa = np.array([np.array([1, 1, 1]),np.array([2,2,2,2,2]),np.array([3,3,3,3]),np.array([4,4])])

In [20]:
bb = aa.reshape((int(len(aa)/2), 2, -1))

In [21]:
bb.shape

(2, 2, 1)

In [22]:
bb

array([[[array([1, 1, 1])],
        [array([2, 2, 2, 2, 2])]],

       [[array([3, 3, 3, 3])],
        [array([4, 4])]]], dtype=object)

In [46]:
data1 = pd.DataFrame(columns=[21], data=["Synkope", 1.3, 4.3, 4.5])
data2 = pd.DataFrame(columns=[11], data=["Synkope", 1.3, 4.3])

data = pd.concat([pd.DataFrame(), data2], axis=1, ignore_index=True)
data

         0
0  Synkope
1      1.3
2      4.3

In [39]:
pd.concat([data, pd.DataFrame(columns=[21], data=["Synkope", 1.3, 4.3, 4.5])])

        11       21
0  Synkope      NaN
1      1.3      NaN
2      4.3      NaN
0      NaN  Synkope
1      NaN      1.3
2      NaN      4.3
3      NaN      4.5

In [36]:
data[22] =

        11
0  Synkope
1      1.3
2      4.3

In [50]:
df1 = pd.DataFrame([['a', 1], ['b', 2], ['c', 3]], columns=['letter', 'number'])

In [58]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george'], [1, 3]], columns=['animal', 'name'])
df4

   animal    name
0    bird   polly
1  monkey  george
2       1       3

In [54]:
pd.concat([df1, df4], axis=1, ignore_index=True)

   0  1       2       3
0  a  1    bird   polly
1  b  2  monkey  george
2  c  3     NaN     NaN

In [55]:
pd.concat([df1, df4], axis=1, ignore_index=False)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george
2      c       3     NaN     NaN

In [70]:
aa = np.array([1.3, 2.7])
st = np.array(["ss"])
bb = aa.tolist()
res = st.tolist() + aa.tolist()

In [71]:
res

['ss', 1.3, 2.7]